*** src/einmo_suite.rs:534:37: replace == with != in evaluate_verified_attestation

*** mutation diff:
--- src/einmo_suite.rs
+++ replace == with != in evaluate_verified_attestation
@@ -526,17 +526,17 @@
 fn evaluate_verified_attestation(
     file: &EinmoFile,
     expected_prefix: Option<&str>,
 ) -> AttestationPolicyResult {
     let verified_signers: Vec<String> = file
         .stamps()
         .entries()
         .iter()
-        .filter(|stamp| stamp.key() == Stage::Verified.stamp_key())
+        .filter(|stamp| stamp.key() != /* ~ changed by cargo-mutants ~ */ Stage::Verified.stamp_key())
         .map(|stamp| stamp.pubkey_hex().to_string())
         .collect();
     let computer_key_offenders = verified_signers
         .iter()
         .filter(|pubkey| crate::signature::is_computer_key(pubkey))
         .cloned()
         .collect::<Vec<_>>();
     let expected_reviewer_match = expected_prefix.map(|prefix| {

---- einmo_suite::tests::verified_attestation_zero_verified_stamps_fails stdout ----

thread 'einmo_suite::tests::verified_attestation_zero_verified_stamps_fails' (4520) panicked at src/einmo_suite.rs:2139:9:
  [verified] a.foo.einmo: stage:verified is signed by the well-known key generated from the empty passphrase — an AI attested where a human was required
      → a human must sign: `einmo promote checked to verified <suite> --interactive`
  [verified] a.foo.einmo: stage:verified is signed by the well-known key generated from the empty passphrase — an AI attested where a human was required
      → a human must sign: `einmo promote checked to verified <suite> --interactive`
  [verified] a.foo.einmo: stage:verified is signed by the well-known key generated from the empty passphrase — an AI attested where a human was required
      → a human must sign: `einmo promote checked to verified

---- einmo_suite::tests::verified_attestation_human_only_passes stdout ----

thread 'einmo_suite::tests::verified_attestation_human_only_passes' (4516) panicked at src/einmo_suite.rs:2101:9:
assertion failed: verified_problems(&config).is_empty()

---- einmo_suite::tests::verified_attestation_reports_every_duplicate_computer_stamp stdout ----

thread 'einmo_suite::tests::verified_attestation_reports_every_duplicate_computer_stamp' (4519) panicked at src/einmo_suite.rs:2116:9:
assertion `left == right` failed: duplicate stamps do not change the failed verdict, but every offender remains visible
  left: 3
 right: 2

failures:
    einmo_suite::tests::verified_attestation_duplicate_identical_stamp_does_not_change_verdict
    einmo_suite::tests::verified_attestation_expected_reviewer_among_cosigners_passes
    einmo_suite::tests::verified_attestation_human_only_passes
    einmo_suite::tests::verified_attestation_reports_every_duplicate_computer_stamp
    einmo_suite::tests::verified_attestation_zero_verified_stamps_fails

test result: FAILED. 4 passed; 5 failed; 0 ignored; 0 measured; 386 filtered out; finished in 14.20s

*** result: Failure(101)
