*** src/einmo_suite.rs:547:25: delete ! in evaluate_verified_attestation

*** mutation diff:
--- src/einmo_suite.rs
+++ delete ! in evaluate_verified_attestation
@@ -539,17 +539,17 @@
         .filter(|pubkey| crate::signature::is_computer_key(pubkey))
         .cloned()
         .collect::<Vec<_>>();
     let expected_reviewer_match = expected_prefix.map(|prefix| {
         verified_signers
             .iter()
             .any(|pubkey| pubkey.starts_with(prefix))
     });
-    let final_verdict = !verified_signers.is_empty()
+    let final_verdict =  /* ~ changed by cargo-mutants ~ */verified_signers.is_empty()
         && computer_key_offenders.is_empty()
         && expected_reviewer_match.unwrap_or(true);
     AttestationPolicyResult {
         verified_signers,
         computer_key_offenders,
         expected_reviewer_match,
         final_verdict,
     }

---- einmo_suite::tests::verified_attestation_zero_verified_stamps_fails stdout ----

thread 'einmo_suite::tests::verified_attestation_zero_verified_stamps_fails' (7997) panicked at src/einmo_suite.rs:905:13:
assertion `left == right` failed
  left: true
 right: false

---- einmo_suite::tests::verified_attestation_human_only_passes stdout ----

thread 'einmo_suite::tests::verified_attestation_human_only_passes' (7993) panicked at src/einmo_suite.rs:905:13:
assertion `left == right` failed
  left: false
 right: true

---- einmo_suite::tests::verified_attestation_duplicate_identical_stamp_does_not_change_verdict stdout ----

thread 'einmo_suite::tests::verified_attestation_duplicate_identical_stamp_does_not_change_verdict' (7991) panicked at src/einmo_suite.rs:905:13:
assertion `left == right` failed
  left: false
 right: true

failures:
    einmo_suite::tests::verified_attestation_duplicate_identical_stamp_does_not_change_verdict
    einmo_suite::tests::verified_attestation_expected_reviewer_among_cosigners_passes
    einmo_suite::tests::verified_attestation_human_only_passes
    einmo_suite::tests::verified_attestation_zero_verified_stamps_fails

test result: FAILED. 5 passed; 4 failed; 0 ignored; 0 measured; 386 filtered out; finished in 14.80s

*** result: Failure(101)
