*** src/einmo_suite.rs:548:9: replace && with || in evaluate_verified_attestation

*** mutation diff:
--- src/einmo_suite.rs
+++ replace && with || in evaluate_verified_attestation
@@ -540,17 +540,17 @@
         .cloned()
         .collect::<Vec<_>>();
     let expected_reviewer_match = expected_prefix.map(|prefix| {
         verified_signers
             .iter()
             .any(|pubkey| pubkey.starts_with(prefix))
     });
     let final_verdict = !verified_signers.is_empty()
-        && computer_key_offenders.is_empty()
+        || /* ~ changed by cargo-mutants ~ */ computer_key_offenders.is_empty()
         && expected_reviewer_match.unwrap_or(true);
     AttestationPolicyResult {
         verified_signers,
         computer_key_offenders,
         expected_reviewer_match,
         final_verdict,
     }
 }

---- einmo_suite::tests::verified_attestation_zero_verified_stamps_fails stdout ----

thread 'einmo_suite::tests::verified_attestation_zero_verified_stamps_fails' (6838) panicked at src/einmo_suite.rs:905:13:
assertion `left == right` failed
  left: true
 right: false

---- einmo_suite::tests::verified_attestation_missing_expected_reviewer_fails stdout ----

thread 'einmo_suite::tests::verified_attestation_missing_expected_reviewer_fails' (6836) panicked at src/einmo_suite.rs:905:13:
assertion `left == right` failed
  left: true
 right: false

---- einmo_suite::tests::verified_attestation_reports_every_duplicate_computer_stamp stdout ----

thread 'einmo_suite::tests::verified_attestation_reports_every_duplicate_computer_stamp' (6837) panicked at src/einmo_suite.rs:905:13:
assertion `left == right` failed
  left: true
 right: false

failures:
    einmo_suite::tests::verified_attestation_computer_then_human_fails
    einmo_suite::tests::verified_attestation_human_then_computer_fails
    einmo_suite::tests::verified_attestation_missing_expected_reviewer_fails
    einmo_suite::tests::verified_attestation_reports_every_duplicate_computer_stamp
    einmo_suite::tests::verified_attestation_zero_verified_stamps_fails

test result: FAILED. 4 passed; 5 failed; 0 ignored; 0 measured; 386 filtered out; finished in 14.66s

*** result: Failure(101)
