*** src/einmo_suite.rs:549:9: replace && with || in evaluate_verified_attestation

*** mutation diff:
--- src/einmo_suite.rs
+++ replace && with || in evaluate_verified_attestation
@@ -541,17 +541,17 @@
         .collect::<Vec<_>>();
     let expected_reviewer_match = expected_prefix.map(|prefix| {
         verified_signers
             .iter()
             .any(|pubkey| pubkey.starts_with(prefix))
     });
     let final_verdict = !verified_signers.is_empty()
         && computer_key_offenders.is_empty()
-        && expected_reviewer_match.unwrap_or(true);
+        || /* ~ changed by cargo-mutants ~ */ expected_reviewer_match.unwrap_or(true);
     AttestationPolicyResult {
         verified_signers,
         computer_key_offenders,
         expected_reviewer_match,
         final_verdict,
     }
 }

---- einmo_suite::tests::verified_attestation_zero_verified_stamps_fails stdout ----

thread 'einmo_suite::tests::verified_attestation_zero_verified_stamps_fails' (5679) panicked at src/einmo_suite.rs:905:13:
assertion `left == right` failed
  left: true
 right: false

---- einmo_suite::tests::verified_attestation_missing_expected_reviewer_fails stdout ----

thread 'einmo_suite::tests::verified_attestation_missing_expected_reviewer_fails' (5677) panicked at src/einmo_suite.rs:905:13:
assertion `left == right` failed
  left: true
 right: false

---- einmo_suite::tests::verified_attestation_reports_every_duplicate_computer_stamp stdout ----

thread 'einmo_suite::tests::verified_attestation_reports_every_duplicate_computer_stamp' (5678) panicked at src/einmo_suite.rs:905:13:
assertion `left == right` failed
  left: true
 right: false

failures:
    einmo_suite::tests::verified_attestation_computer_then_human_fails
    einmo_suite::tests::verified_attestation_human_then_computer_fails
    einmo_suite::tests::verified_attestation_missing_expected_reviewer_fails
    einmo_suite::tests::verified_attestation_reports_every_duplicate_computer_stamp
    einmo_suite::tests::verified_attestation_zero_verified_stamps_fails

test result: FAILED. 4 passed; 5 failed; 0 ignored; 0 measured; 386 filtered out; finished in 14.54s

*** result: Failure(101)
