*** src/einmo_suite.rs:871:9: replace EinmoTestRunner::attestation_problems -> Result<Vec<Problem>> with Ok(vec![])

*** mutation diff:
--- src/einmo_suite.rs
+++ replace EinmoTestRunner::attestation_problems -> Result<Vec<Problem>> with Ok(vec![])
@@ -863,55 +863,17 @@
     }
 
     /// Is every `verified/` artifact attested by the reviewer, and none by the
     /// computer key? (V6/V7.)
     ///
     /// With no reviewer key configured, V6 cannot be judged — but V7 still can,
     /// and must: an AI-signed `verified/` is detectable regardless.
     fn attestation_problems(&self) -> Result<Vec<Problem>> {
-        let dir = self.config.stage_dir(Stage::Verified);
-        let (present, _) =
-            crate::stage::walk_input_tree_reporting(&dir, self.config.walk_depth_limit())?;
-        let expected_prefix = self.config.reviewer_key_prefix().map(str::to_string);
-        let mut out = Vec::new();
-        for rel in present {
-            let path = dir.join(&rel);
-            let Ok(file) = EinmoFile::from_file(&path) else {
-                continue; // SignatureInvalid is reported by the stage-pair check
-            };
-            let policy = evaluate_verified_attestation(&file, expected_prefix.as_deref());
-            let mut artifact_problems = Vec::new();
-            if policy.verified_signers.is_empty() {
-                artifact_problems.push(Problem::MissingVerifiedAttestation { path: rel.clone() });
-            }
-            for _pubkey in &policy.computer_key_offenders {
-                // The computer key is well-known and deterministic. One
-                // problem per offending stamp makes duplicates visible while
-                // leaving the boolean verdict unchanged.
-                artifact_problems
-                    .push(Problem::KeyDerivedFromEmptyPassphrase { path: rel.clone() });
-            }
-            if let (Some(false), Some(prefix)) =
-                (policy.expected_reviewer_match, expected_prefix.as_ref())
-            {
-                let mut found = policy.verified_signers.clone();
-                found.sort();
-                found.dedup();
-                artifact_problems.push(Problem::MissingExpectedReviewer {
-                    path: rel.clone(),
-                    expected_prefix: prefix.clone(),
-                    found,
-                });
-            }
-            debug_assert_eq!(policy.final_verdict, artifact_problems.is_empty());
-            out.extend(artifact_problems);
-        }
-        out.sort_by(|x, y| x.path().cmp(&y.path()));
-        Ok(out)
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 
     fn is_catastrophe_crumb(&self, out_path: &Path) -> bool {
         match EinmoFile::from_file(out_path) {
             Ok(file) => file
                 .metadata()
                 .status_detail
                 .starts_with("TEST IN PROGRESS"),

---- einmo_suite::tests::verified_attestation_zero_verified_stamps_fails stdout ----

thread 'einmo_suite::tests::verified_attestation_zero_verified_stamps_fails' (9156) panicked at src/einmo_suite.rs:2101:9:

---- einmo_suite::tests::verified_attestation_missing_expected_reviewer_fails stdout ----

thread 'einmo_suite::tests::verified_attestation_missing_expected_reviewer_fails' (9154) panicked at src/einmo_suite.rs:2039:9:

---- einmo_suite::tests::verified_attestation_reports_every_duplicate_computer_stamp stdout ----

thread 'einmo_suite::tests::verified_attestation_reports_every_duplicate_computer_stamp' (9155) panicked at src/einmo_suite.rs:2078:9:
assertion `left == right` failed: duplicate stamps do not change the failed verdict, but every offender remains visible
  left: 0
 right: 2

failures:
    einmo_suite::tests::verified_attestation_computer_then_human_fails
    einmo_suite::tests::verified_attestation_human_then_computer_fails
    einmo_suite::tests::verified_attestation_missing_expected_reviewer_fails
    einmo_suite::tests::verified_attestation_reports_every_duplicate_computer_stamp
    einmo_suite::tests::verified_attestation_zero_verified_stamps_fails

test result: FAILED. 4 passed; 5 failed; 0 ignored; 0 measured; 386 filtered out; finished in 14.66s

*** result: Failure(101)
