*** src/verify.rs:124:9: replace EinmoFile::from_file -> Result<Self> with Ok(Default::default())

*** mutation diff:
--- src/verify.rs
+++ replace EinmoFile::from_file -> Result<Self> with Ok(Default::default())
@@ -116,25 +116,17 @@
     /// This is the verify-on-inspect entry point every reading code path uses.
     ///
     /// # Errors
     ///
     /// Returns [`EinmoError::Io`] if the file cannot be read,
     /// [`EinmoError::Parse`] if malformed, or [`EinmoError::Verification`] if
     /// any stamp fails.
     pub fn from_file(path: &Path) -> Result<Self> {
-        let bytes = std::fs::read(path).map_err(|e| EinmoError::io(path, e))?;
-        verify_bytes(&bytes).map_err(|e| match e {
-            // Annotate verification/parse failures with the path for the caller.
-            EinmoError::Verification(msg) => {
-                EinmoError::Verification(format!("{}: {msg}", path.display()))
-            }
-            EinmoError::Parse(msg) => EinmoError::Parse(format!("{}: {msg}", path.display())),
-            other => other,
-        })
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 // ---------------------------------------------------------------------------
 // The `verify` walk over a stage (or all stages)
 // ---------------------------------------------------------------------------
 
 /// The outcome of verifying one file in a stage.

*** result: Success
