*** src/verify.rs:29:5: replace verify_all -> Vec<StampVerification> with vec![]

*** mutation diff:
--- src/verify.rs
+++ replace verify_all -> Vec<StampVerification> with vec![]
@@ -21,17 +21,17 @@
 // ---------------------------------------------------------------------------
 
 /// Per-stamp verification verdict for an [`EinmoFile`].
 pub type StampVerification = StampCheck;
 
 /// Verify every stamp of an already-parsed file against its own signed prefix.
 #[must_use]
 pub fn verify_all(file: &EinmoFile) -> Vec<StampVerification> {
-    file.verify_all()
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Parse `bytes` and verify all stamps; return the file only if the chain is
 /// fully valid (verify-on-inspect).
 ///
 /// # Errors
 ///
 /// Returns [`EinmoError::Parse`] on a malformed envelope, or

---- compare::tests::compare_files_only_in_one_stage stdout ----

thread 'compare::tests::compare_files_only_in_one_stage' (177740) panicked at src/compare.rs:578:9:
assertion `left == right` failed
  left: []
 right: ["a.foo.einmo"]

---- case::tests::flag_moves_the_artifact_into_the_origin_stages_own_sink stdout ----

thread 'case::tests::flag_moves_the_artifact_into_the_origin_stages_own_sink' (177303) panicked at src/case.rs:988:49:
called `Result::unwrap()` on an `Err` value: Verification("stamp(s) failed: stage:output")

---- case::tests::agreement_one_sided_reports_which_side_is_present_both_directions stdout ----

thread 'case::tests::agreement_one_sided_reports_which_side_is_present_both_directions' (177298) panicked at src/case.rs:567:9:
assertion `left == right` failed
  left: Some(Tampered { stages: [Output] })
 right: Some(OneSided { present: Output, absent: Checked })

failures:
    case::tests::agreement_all_present_and_agree
    case::tests::agreement_comments_repro_policy_controls_whether_comments_only_divergence_counts
    case::tests::agreement_differ_reports_the_diverged_section_names
    case::tests::agreement_one_sided_reports_which_side_is_present_both_directions
    case::tests::agreement_p1_repro_unpopulated_verified_does_not_affect_output_checked_agreement
    case::tests::agreement_tampered_is_never_folded_into_differ
    case::tests::flag_concatenates_with_an_existing_flagged_note
    case::tests::flag_moves_the_artifact_into_the_origin_stages_own_sink
    case::tests::promote_already_signed_by_this_key_is_a_true_noop
    case::tests::promote_cosigns_when_destination_content_matches
    case::tests::promote_deliberate_asymmetry_comments_only_difference_is_not_a_match
    case::tests::promote_flags_non_human_for_the_computer_key_on_verifie

test result: FAILED. 196 passed; 160 failed; 0 ignored; 0 measured; 0 filtered out; finished in 817.92s

*** result: Failure(101)
