*** src/verify.rs:40:5: replace verify_bytes -> Result<EinmoFile> with Ok(Default::default())

*** mutation diff:
--- src/verify.rs
+++ replace verify_bytes -> Result<EinmoFile> with Ok(Default::default())
@@ -32,35 +32,17 @@
 /// Parse `bytes` and verify all stamps; return the file only if the chain is
 /// fully valid (verify-on-inspect).
 ///
 /// # Errors
 ///
 /// Returns [`EinmoError::Parse`] on a malformed envelope, or
 /// [`EinmoError::Verification`] if any stamp fails.
 pub fn verify_bytes(bytes: &[u8]) -> Result<EinmoFile> {
-    let file = EinmoFile::parse(bytes)?;
-    // Verify against the ACTUAL file bytes up to the STAMPS section, not the
-    // recomputed canonical form. This detects metadata whitespace tampering
-    // that `parse()` would normalize away (e.g. extra spaces after a `key:`).
-    let raw_prefix = raw_signed_prefix(bytes, &file)?;
-    let checks = file.stamps().verify_chain(raw_prefix);
-    let failed: Vec<&str> = checks
-        .iter()
-        .filter(|c| !c.ok)
-        .map(|c| c.key.as_str())
-        .collect();
-    if failed.is_empty() {
-        Ok(file)
-    } else {
-        Err(EinmoError::Verification(format!(
-            "stamp(s) failed: {}",
-            failed.join(", ")
-        )))
-    }
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Extract the raw bytes from the start of the file up to (not including) the
 /// STAMPS section's content — i.e. everything up to and including the separator
 /// that introduces the STAMPS section. This is the byte range that stage stamps
 /// sign as "prior bytes".
 ///
 /// The file layout is:

---- case::tests::agreement_one_sided_reports_which_side_is_present_both_directions stdout ----

thread 'case::tests::agreement_one_sided_reports_which_side_is_present_both_directions' (177468) panicked at src/case.rs:567:9:
assertion `left == right` failed
  left: Some(Tampered { stages: [Output] })
 right: Some(OneSided { present: Output, absent: Checked })

---- compare::tests::compare_files_only_in_one_stage stdout ----

thread 'compare::tests::compare_files_only_in_one_stage' (177742) panicked at src/compare.rs:578:9:
assertion `left == right` failed
  left: []
 right: ["a.foo.einmo"]

---- case::tests::flag_concatenates_with_an_existing_flagged_note stdout ----

thread 'case::tests::flag_concatenates_with_an_existing_flagged_note' (177472) panicked at src/case.rs:1021:43:
called `Result::unwrap()` on an `Err` value: Verification("stamp(s) failed: stage:output")

failures:
    case::tests::agreement_all_present_and_agree
    case::tests::agreement_comments_repro_policy_controls_whether_comments_only_divergence_counts
    case::tests::agreement_differ_reports_the_diverged_section_names
    case::tests::agreement_one_sided_reports_which_side_is_present_both_directions
    case::tests::agreement_p1_repro_unpopulated_verified_does_not_affect_output_checked_agreement
    case::tests::agreement_tampered_is_never_folded_into_differ
    case::tests::flag_concatenates_with_an_existing_flagged_note
    case::tests::flag_moves_the_artifact_into_the_origin_stages_own_sink
    case::tests::promote_already_signed_by_this_key_is_a_true_noop
    case::tests::promote_cosigns_when_destination_content_matches
    case::tests::promote_deliberate_asymmetry_comments_only_difference_is_not_a_match
    case::tests::promote_flags_non_human_for_the_computer_key_on_verifie

test result: FAILED. 196 passed; 160 failed; 0 ignored; 0 measured; 0 filtered out; finished in 816.63s

*** result: Failure(101)
