*** src/verify.rs:48:21: delete ! in verify_bytes

*** mutation diff:
--- src/verify.rs
+++ delete ! in verify_bytes
@@ -40,17 +40,17 @@
     let file = EinmoFile::parse(bytes)?;
     // Verify against the ACTUAL file bytes up to the STAMPS section, not the
     // recomputed canonical form. This detects metadata whitespace tampering
     // that `parse()` would normalize away (e.g. extra spaces after a `key:`).
     let raw_prefix = raw_signed_prefix(bytes, &file)?;
     let checks = file.stamps().verify_chain(raw_prefix);
     let failed: Vec<&str> = checks
         .iter()
-        .filter(|c| !c.ok)
+        .filter(|c|  /* ~ changed by cargo-mutants ~ */c.ok)
         .map(|c| c.key.as_str())
         .collect();
     if failed.is_empty() {
         Ok(file)
     } else {
         Err(EinmoError::Verification(format!(
             "stamp(s) failed: {}",
             failed.join(", ")

---- compare::tests::compare_files_only_in_one_stage stdout ----

thread 'compare::tests::compare_files_only_in_one_stage' (177737) panicked at src/compare.rs:578:9:
assertion `left == right` failed
  left: []
 right: ["a.foo.einmo"]

---- case::tests::flag_concatenates_with_an_existing_flagged_note stdout ----

thread 'case::tests::flag_concatenates_with_an_existing_flagged_note' (177195) panicked at src/case.rs:1021:43:
called `Result::unwrap()` on an `Err` value: Verification("stamp(s) failed: stage:output")

---- case::tests::retract_verified_leaves_checked stdout ----

thread 'case::tests::retract_verified_leaves_checked' (177208) panicked at src/case.rs:1098:18:
called `Result::unwrap()` on an `Err` value: Verification("stamp(s) failed: stage:output")

failures:
    case::tests::agreement_all_present_and_agree
    case::tests::agreement_comments_repro_policy_controls_whether_comments_only_divergence_counts
    case::tests::agreement_differ_reports_the_diverged_section_names
    case::tests::agreement_one_sided_reports_which_side_is_present_both_directions
    case::tests::agreement_p1_repro_unpopulated_verified_does_not_affect_output_checked_agreement
    case::tests::agreement_tampered_is_never_folded_into_differ
    case::tests::flag_concatenates_with_an_existing_flagged_note
    case::tests::flag_moves_the_artifact_into_the_origin_stages_own_sink
    case::tests::promote_already_signed_by_this_key_is_a_true_noop
    case::tests::promote_cosigns_when_destination_content_matches
    case::tests::promote_deliberate_asymmetry_comments_only_difference_is_not_a_match
    case::tests::promote_flags_non_human_for_the_computer_key_on_verifie

test result: FAILED. 197 passed; 159 failed; 0 ignored; 0 measured; 0 filtered out; finished in 819.57s

*** result: Failure(101)
