*** src/verify.rs:76:5: replace raw_signed_prefix -> Result<&'a[u8]> with Ok(Vec::leak(vec![1]))

*** mutation diff:
--- src/verify.rs
+++ replace raw_signed_prefix -> Result<&'a[u8]> with Ok(Vec::leak(vec![1]))
@@ -68,40 +68,17 @@
 /// header_line\n
 /// <metadata>
 /// SEP <body1> SEP <body2> SEP ... SEP <stamps>
 /// ```
 /// The signed prefix includes the header, metadata, every body, and the final
 /// separator that introduces STAMPS. So we must find the `(num_bodies + 1)`-th
 /// occurrence of `separator` after the header line.
 fn raw_signed_prefix<'a>(bytes: &'a [u8], file: &EinmoFile) -> Result<&'a [u8]> {
-    let separator = file.separator().as_bytes();
-    let num_bodies = file.sections().len();
-    // Skip the header line (everything up to and including the first LF).
-    let header_end = bytes
-        .iter()
-        .position(|&b| b == b'\n')
-        .ok_or_else(|| EinmoError::Parse("missing header newline".into()))?;
-    let mut search_from = header_end + 1;
-    let mut prefix_end = 0usize;
-    for i in 0..(num_bodies + 1) {
-        match find_subsequence(&bytes[search_from..], separator) {
-            Some(pos) => {
-                prefix_end = search_from + pos + separator.len();
-                search_from = prefix_end;
-            }
-            None => {
-                return Err(EinmoError::Parse(format!(
-                    "could not find separator #{} for raw signed prefix",
-                    i + 1
-                )));
-            }
-        }
-    }
-    Ok(&bytes[..prefix_end])
+    Ok(Vec::leak(vec![1])) /* ~ changed by cargo-mutants ~ */
 }
 
 fn find_subsequence(haystack: &[u8], needle: &[u8]) -> Option<usize> {
     if needle.is_empty() {
         return None;
     }
     haystack.windows(needle.len()).position(|w| w == needle)
 }

---- case::tests::agreement_tampered_is_never_folded_into_differ stdout ----

thread 'case::tests::agreement_tampered_is_never_folded_into_differ' (177250) panicked at src/case.rs:627:9:
assertion `left == right` failed
  left: Some(Tampered { stages: [Output, Checked] })
 right: Some(Tampered { stages: [Checked] })

---- case::tests::flag_moves_the_artifact_into_the_origin_stages_own_sink stdout ----

thread 'case::tests::flag_moves_the_artifact_into_the_origin_stages_own_sink' (177252) panicked at src/case.rs:988:49:
called `Result::unwrap()` on an `Err` value: Verification("stamp(s) failed: stage:output")

---- case::tests::agreement_one_sided_reports_which_side_is_present_both_directions stdout ----

thread 'case::tests::agreement_one_sided_reports_which_side_is_present_both_directions' (177247) panicked at src/case.rs:567:9:
assertion `left == right` failed
  left: Some(Tampered { stages: [Output] })
 right: Some(OneSided { present: Output, absent: Checked })

failures:
    case::tests::agreement_all_present_and_agree
    case::tests::agreement_comments_repro_policy_controls_whether_comments_only_divergence_counts
    case::tests::agreement_differ_reports_the_diverged_section_names
    case::tests::agreement_one_sided_reports_which_side_is_present_both_directions
    case::tests::agreement_p1_repro_unpopulated_verified_does_not_affect_output_checked_agreement
    case::tests::agreement_tampered_is_never_folded_into_differ
    case::tests::flag_concatenates_with_an_existing_flagged_note
    case::tests::flag_moves_the_artifact_into_the_origin_stages_own_sink
    case::tests::promote_already_signed_by_this_key_is_a_true_noop
    case::tests::promote_cosigns_when_destination_content_matches
    case::tests::promote_deliberate_asymmetry_comments_only_difference_is_not_a_match
    case::tests::promote_flags_non_human_for_the_computer_key_on_verifie

test result: FAILED. 196 passed; 160 failed; 0 ignored; 0 measured; 0 filtered out; finished in 818.42s

*** result: Failure(101)
