*** src/verify.rs:83:38: replace + with * in raw_signed_prefix

*** mutation diff:
--- src/verify.rs
+++ replace + with * in raw_signed_prefix
@@ -75,17 +75,17 @@
 fn raw_signed_prefix<'a>(bytes: &'a [u8], file: &EinmoFile) -> Result<&'a [u8]> {
     let separator = file.separator().as_bytes();
     let num_bodies = file.sections().len();
     // Skip the header line (everything up to and including the first LF).
     let header_end = bytes
         .iter()
         .position(|&b| b == b'\n')
         .ok_or_else(|| EinmoError::Parse("missing header newline".into()))?;
-    let mut search_from = header_end + 1;
+    let mut search_from = header_end * /* ~ changed by cargo-mutants ~ */ 1;
     let mut prefix_end = 0usize;
     for i in 0..(num_bodies + 1) {
         match find_subsequence(&bytes[search_from..], separator) {
             Some(pos) => {
                 prefix_end = search_from + pos + separator.len();
                 search_from = prefix_end;
             }
             None => {

---- case::tests::flag_concatenates_with_an_existing_flagged_note stdout ----

thread 'case::tests::flag_concatenates_with_an_existing_flagged_note' (177637) panicked at src/case.rs:1021:43:
called `Result::unwrap()` on an `Err` value: Verification("stamp(s) failed: stage:output")

---- compare::tests::compare_files_only_in_one_stage stdout ----

thread 'compare::tests::compare_files_only_in_one_stage' (177748) panicked at src/compare.rs:578:9:
assertion `left == right` failed
  left: []
 right: ["a.foo.einmo"]

---- case::tests::flag_moves_the_artifact_into_the_origin_stages_own_sink stdout ----

thread 'case::tests::flag_moves_the_artifact_into_the_origin_stages_own_sink' (177638) panicked at src/case.rs:988:49:
called `Result::unwrap()` on an `Err` value: Verification("stamp(s) failed: stage:output")

failures:
    case::tests::agreement_all_present_and_agree
    case::tests::agreement_comments_repro_policy_controls_whether_comments_only_divergence_counts
    case::tests::agreement_differ_reports_the_diverged_section_names
    case::tests::agreement_one_sided_reports_which_side_is_present_both_directions
    case::tests::agreement_p1_repro_unpopulated_verified_does_not_affect_output_checked_agreement
    case::tests::agreement_tampered_is_never_folded_into_differ
    case::tests::flag_concatenates_with_an_existing_flagged_note
    case::tests::flag_moves_the_artifact_into_the_origin_stages_own_sink
    case::tests::promote_already_signed_by_this_key_is_a_true_noop
    case::tests::promote_cosigns_when_destination_content_matches
    case::tests::promote_deliberate_asymmetry_comments_only_difference_is_not_a_match
    case::tests::promote_flags_non_human_for_the_computer_key_on_verifie

test result: FAILED. 196 passed; 160 failed; 0 ignored; 0 measured; 0 filtered out; finished in 814.56s

*** result: Failure(101)
