*** src/verify.rs:88:48: replace + with * in raw_signed_prefix

*** mutation diff:
--- src/verify.rs
+++ replace + with * in raw_signed_prefix
@@ -80,17 +80,17 @@
         .iter()
         .position(|&b| b == b'\n')
         .ok_or_else(|| EinmoError::Parse("missing header newline".into()))?;
     let mut search_from = header_end + 1;
     let mut prefix_end = 0usize;
     for i in 0..(num_bodies + 1) {
         match find_subsequence(&bytes[search_from..], separator) {
             Some(pos) => {
-                prefix_end = search_from + pos + separator.len();
+                prefix_end = search_from + pos * /* ~ changed by cargo-mutants ~ */ separator.len();
                 search_from = prefix_end;
             }
             None => {
                 return Err(EinmoError::Parse(format!(
                     "could not find separator #{} for raw signed prefix",
                     i + 1
                 )));
             }

*** result: Success
